

{
    "intents": [
      {
        "tag": "greeting",
        "patterns": [
          "Hi", "Hello", "Hey", "How are you", "What's up", "Good morning", "Good afternoon", 
          "Good evening", "Greetings", "Hi there", "Hello Creatus", "Hey Creatus"
        ],
        "responses": [
          "Hello! Welcome to Creatus. How can I assist you today?",
          "Hi there! I'm here to help with Creatus. What would you like to know?",
          "Greetings! I'm the Creatus AI assistant. How may I help you?",
          "Hello! I'm excited to help you with Creatus. What's on your mind?",
          "Hi! Welcome to the world of Creatus. What can I do for you today?"
        ]
      },
      {
        "tag": "creator",
        "patterns": [
          "Who created Creatus?", "Who is the developer?", "Who made this app?",
          "Tell me about the creator", "Who is Pranav Lejith?", "What is Amphibiar?",
          "Who is behind Creatus?", "Information about the developer"
        ],
        "responses": [
          "Creatus was created by Pranav Lejith, also known as Amphibiar, from 9th K. He's the creator of Delta, Theta, Alpha and Creatus.",
          "The  mind behind Creatus is Pranav Lejith (Amphibiar) of 9th K. He developed this app to make AI model creation accessible to everyone.",
          "Pranav Lejith, a student from 9th K who goes by the alias Amphibiar, is the creator of Creatus. His goal was to simplify the process of creating AI models.",
          "Creatus is the creation of Pranav Lejith, a young innovator from 9th K. He's also known as Amphibiar in the developer community."
        ]
      },
      {
        "tag": "about",
        "patterns": [
          "What is Creatus?", "Tell me about Creatus", "What does Creatus do?",
          "Explain Creatus to me", "Give me an overview of Creatus",
          "What's the purpose of Creatus?", "How would you describe Creatus?"
        ],
        "responses": [
          "Creatus is an AI-powered model creator that allows users to build and train custom image classification models without coding. It provides an intuitive interface for uploading images, training models, and testing predictions.",
          "Creatus is a user-friendly platform designed to democratize AI model creation. It enables users to create image classification models without any programming knowledge, making AI accessible to everyone.",
          "At its core, Creatus is a tool that simplifies the process of creating AI models for image classification. It handles the complex backend processes, allowing users to focus on their data and results.",
          "Creatus is an innovative application that bridges the gap between complex AI technologies and everyday users. It allows you to create, train, and test image classification models through a simple, intuitive interface."
        ]
      },
      {
        "tag": "features",
        "patterns": [
          "What features does Creatus have?", "What can I do with Creatus?",
          "Tell me about Creatus features", "What are the capabilities of Creatus?",
          "What makes Creatus special?", "How is Creatus different from other tools?"
        ],
        "responses": [
          "Creatus offers several features: 1) Easy label management, 2) Image upload for each label, 3) Model training with various architectures, 4) Real-time model testing, 5) Model export in TFLite or H5 format, 6) Advanced options for developers.",
          "Creatus stands out with its user-friendly interface and powerful features. You can manage labels, upload images, train models using different architectures, test your model in real-time, and even export your model for use in other applications.",
          "The key features of Creatus include intuitive label management, support for multiple image formats, customizable model architectures, real-time testing capabilities, and the ability to export your trained model in industry-standard formats.",
          "Creatus is packed with features to make AI model creation accessible. From easy data management to advanced model training options, real-time testing, and model exporting, Creatus provides a complete toolkit for image classification tasks."
        ]
      },
      {
        "tag": "usage",
        "patterns": [
          "How do I use Creatus?", "Guide me through using Creatus", "Steps to use Creatus",
          "Can you explain how to use Creatus?", "What's the process for using Creatus?",
          "I'm new to Creatus, how do I start?", "Give me a tutorial on Creatus"
        ],
        "responses": [
          "To use Creatus: 1) Add labels, 2) Upload images for each label, 3) Train the model, 4) Test the model with new images, 5) Download the trained model if desired. For more detailed instructions, check the sidebar in the app.",
          "Using Creatus is straightforward: First, create labels for your categories. Then, upload images for each label. Once you have enough data, train your model. After training, you can test it with new images and even download it for external use.",
          "Here's a quick guide to using Creatus: 1. Start by adding labels in the sidebar. 2. Upload relevant images for each label. 3. Click 'Train Model' when you're ready. 4. After training, test your model with new images. 5. Optionally, download your model for use elsewhere.",
          "To get started with Creatus: 1) Use the sidebar to add labels for your categories. 2) Upload several images for each label. 3) Initiate model training. 4) Once trained, test your model's performance. 5) If satisfied, you can export your model. The sidebar contains more detailed instructions."
        ]
      },
      {
        "tag": "labels",
        "patterns": [
          "How do I add labels?", "What are labels in Creatus?", "Can I delete labels?",
          "Explain the concept of labels", "How many labels can I add?",
          "What if I want to change a label?", "Are labels case-sensitive?"
        ],
        "responses": [
          "In Creatus, labels represent the categories you want your model to classify. To add a label, use the 'Enter a new label' input in the sidebar and click 'Add Label'. You can delete labels using the '-' button next to each label in the sidebar.",
          "Labels in Creatus are the categories your model will learn to distinguish. Add them via the sidebar input. There's no strict limit on the number of labels, but more labels require more data and training time. Labels can be deleted or modified as needed.",
          "Adding labels in Creatus is simple: use the sidebar input to enter a label name and click 'Add Label'. These labels define your classification categories. You can add as many as needed, but remember that more labels increase model complexity.",
          "Labels are crucial in Creatus as they define what your model will classify. Add them through the sidebar, and delete them with the '-' button if needed. While there's no set limit, it's best to start with a manageable number of distinct categories."
        ]
      },
      {
        "tag": "image_upload",
        "patterns": [
          "How do I upload images?", "What image formats are supported?", "Image upload process",
          "Can I use any type of image?", "How many images should I upload?",
          "What if my image won't upload?", "Are there size limits for images?"
        ],
        "responses": [
          "To upload images in Creatus, find the section for each label and click the 'Upload images for [label]' button. Creatus supports JPG, JPEG, PNG, and WebP formats. Make sure to upload multiple images for each label to improve model accuracy.",
          "Creatus accepts JPG, JPEG, PNG, and WebP image formats. To upload, locate the upload section for your label and click the button. It's recommended to upload at least 30-50 diverse images per label for better model performance.",
          "Image upload in Creatus is straightforward: click the upload button for each label and select your files. Supported formats are JPG, JPEG, PNG, and WebP. While there's no strict limit, more high-quality, diverse images generally lead to better model performance.",
          "For image uploads, use the 'Upload images for [label]' button in each label's section. Creatus works with JPG, JPEG, PNG, and WebP formats. Aim for at least 50 diverse images per label. If an image won't upload, check its format and size."
        ]
      },
      {
        "tag": "training",
        "patterns": [
          "How do I train the model?", "What happens during training?", "Model training process",
          "How long does training take?", "Can I stop training midway?",
          "What if training fails?", "How do I know if training is successful?"
        ],
        "responses": [
          "To train the model in Creatus, ensure you have at least two labels with uploaded images, then click the 'Train Model' button. During training, Creatus processes your images, builds a neural network, and optimizes it to recognize your labels. You'll see a progress bar during training.",
          "Training in Creatus starts when you click 'Train Model'. The process involves preprocessing your images, creating a neural network, and optimizing it to recognize your labels. Training time varies based on data size and complexity. A progress bar shows the status.",
          "To initiate training, click 'Train Model' after uploading images for at least two labels. Creatus will then process your data and create a custom neural network. Training duration depends on your data and chosen options. The process is complete when the progress bar reaches 100%.",
          "Model training begins when you click 'Train Model'. Creatus will process your images, create a neural network, and optimize it for your labels. Training time varies but is typically a few minutes. You'll see a progress bar, and training is successful when metrics are displayed."
        ]
      },
      {
        "tag": "testing",
        "patterns": [
          "How can I test the model?", "What's the process for testing?", "Can I use my own images for testing?",
          "How accurate is the testing?", "What if the test results are poor?",
          "Can I test multiple images?", "How do I interpret test results?"
        ],
        "responses": [
          "After training, you can test your model by uploading a new image in the 'Test the trained model with a new image' section. Creatus will process the image and show you the predicted label along with a confidence score.",
          "Testing in Creatus is simple: upload a new image in the testing section after training. The model will process it and provide a prediction with a confidence score. You can test as many images as you like to gauge your model's performance.",
          "To test your model, use the 'Test the trained model with a new image' section. Upload an image, and Creatus will display the predicted label and confidence. If results are unsatisfactory, consider retraining with more or diverse data.",
          "Model testing involves uploading new, unseen images in the designated testing area. Creatus will process each image and provide a predicted label with a confidence percentage. This helps you assess how well your model generalizes to new data."
        ]
      },
      {
        "tag": "export",
        "patterns": [
          "How do I export my model?", "What export formats are available?", "Downloading the trained model",
          "Can I use my model outside Creatus?", "What's the difference between export formats?",
          "How large are exported models?", "What comes with the exported model?"
        ],
        "responses": [
          "To export your trained model in Creatus, select your preferred format (TFLite or H5) from the sidebar, then click the 'Download Model' button. The download will include the model file and a Python script with usage instructions.",
          "Creatus allows you to export your model in TFLite or H5 format. Choose your format in the sidebar and click 'Download Model'. You'll receive a zip file containing the model and a Python script explaining how to use it in your own projects.",
          "Exporting is easy: pick TFLite or H5 format from the sidebar, then hit 'Download Model'. TFLite is great for mobile and edge devices, while H5 is better for desktop or server use. The download includes everything you need to use your model externally.",
          "To export, select TFLite or H5 format and click 'Download Model'. TFLite is optimized for mobile devices, while H5 is versatile for various platforms. The exported package includes your model file and a Python script with instructions for using it."
        ]
      },
      {
        "tag": "developer_mode",
        "patterns": [
          "What is developer mode?", "How do I access developer options?", "Advanced features in Creatus",
          "Tell me about Creatus developer features", "Can I customize the model architecture?",
          "What extra options are in developer mode?", "Is developer mode for everyone?"
        ],
        "responses": [
          "Developer mode in Creatus unlocks advanced options like custom model architectures, data augmentation, and detailed performance metrics. To access it, enter a special developer command in the 'Enter a new label' field. Note that this mode is intended for experienced users.",
          "Developer mode provides advanced features for experienced users. It includes options for custom model architectures, data augmentation, and more detailed metrics. For specific information about accessing and using developer mode, please contact the developer.",
          "The developer mode in Creatus is designed for users with machine learning experience. It offers more control over model architecture and training processes. For detailed information about developer mode features, it's best to consult with the developer directly.",
          "Developer mode is an advanced feature set in Creatus, offering more control over model creation and training. While it provides powerful tools, it's primarily for experienced users. For specific details about developer mode, please reach out to the Creatus developer."
        ]
      },
      {
        "tag": "performance",
        "patterns": [
          "How accurate is the model?", "What metrics are used?", "Model performance evaluation",
          "How can I improve model accuracy?", "What affects model performance?",
          "Are Creatus models reliable?", "How do I interpret performance metrics?"
        ],
        "responses": [
          "Creatus evaluates model performance using metrics like accuracy, precision, recall, and F1 score. These metrics are displayed after training in developer mode. The accuracy of your model depends on the quality and quantity of your training data.",
          "Model performance in Creatus is measured by accuracy, precision, recall, and F1 score. To improve performance, ensure you have diverse, high-quality images and sufficient data for each label. Experimenting with different model architectures can also help.",
          "The accuracy of Creatus models varies based on your data. Key metrics include accuracy (overall correctness), precision (true positive rate), recall (sensitivity), and F1 score (balance of precision and recall). More and diverse data generally improves performance.",
          "Creatus uses standard machine learning metrics to evaluate models. Accuracy shows overall correctness, precision indicates true positive rate, recall measures sensitivity, and F1 score balances precision and recall. These help you assess and improve your model's performance."
        ]
      },
      {
        "tag": "troubleshooting",
        "patterns": [
          "I'm having issues with Creatus", "The model isn't training properly", "Error messages in Creatus",
          "Why is my model not accurate?", "Creatus is running slowly", "My images won't upload",
          "The app is crashing", "How do I report a bug?"
        ],
        "responses": [
          "If you're experiencing issues with Creatus, try the following: 1) Ensure you have enough images for each label, 2) Check that your images are in supported formats, 3) Try adjusting advanced options if in developer mode, 4) If the issue persists, please contact the developer for support.",
          "For troubleshooting: 1) Verify you have sufficient, diverse images per label. 2) Ensure images are in JPG, JPEG, PNG, or WebP format. 3) Try restarting the application. 4) If you're in developer mode, revert to default settings. 5) For persistent issues, reach out to the developer.",
          "To resolve Creatus issues: 1) Check your internet connection. 2) Ensure you're using supported image formats. 3) Try with a smaller dataset first. 4) Clear your browser cache. 5) If problems continue, document the issue and contact the developer for assistance.",
          "If you're facing problems: 1) Verify you have at least 30 images per label. 2) Check image formats (JPG, JPEG, PNG, WebP). 3) Restart Creatus. 4) If in developer mode, try standard settings. 5) For ongoing issues, please contact the developer with detailed information about the problem."
        ]
        
      },
      {
        "tag": "bye",
        "patterns": [
          "goodbye", "bye", "boi",
          "See you later", "Talk to you later", "K. Bye",
          "Byee", "Later"
        ],
        "responses": [
          "Bye. Thankyou for using Creatus AI",
          "For troubleshooting: 1) Verify you have sufficient, diverse images per label. 2) Ensure images are in JPG, JPEG, PNG, or WebP format. 3) Try restarting the application. 4) If you're in developer mode, revert to default settings. 5) For persistent issues, reach out to the developer.",
          "To resolve Creatus issues: 1) Check your internet connection. 2) Ensure you're using supported image formats. 3) Try with a smaller dataset first. 4) Clear your browser cache. 5) If problems continue, document the issue and contact the developer for assistance.",
          "If you're facing problems: 1) Verify you have at least 30 images per label. 2) Check image formats (JPG, JPEG, PNG, WebP). 3) Restart Creatus. 4) If in developer mode, try standard settings. 5) For ongoing issues, please contact the developer with detailed information about the problem."
        ]
        
      }
    ]
  }